Quran-BASH-Scripts-Documentation.org

* IMPORTANT INFORMATION:
  Please note that this site and the programs it provides are a work in progress. We are still in beta.


* IMPORTANT NOTES:
** Important Note N°1
  The first lines of the scripts contain:

  -variable declations

  -a function that gets the root directory of the script (and uses that to search for the relevent files needed by the script)
 
  -=getopt= related stuff to check command line arguments

  Just after that, appear huge functions of thousands of lines which get for us various information related to verses, suwar, juz, hizb, rub-`ul-hizb or page numbers. Since the Quran has 6236 verses, 114 suwar, 30 juz, 60 hizb, 240 rub-`ul-hizb and 604 pages, it is only natural that these functions would need thousands of lines. It is important to make this known because anyone who looks to the code would get frustrated as he/she scrolls down endless lines. To edit the code go to the last line of the scripts and then scroll up to the last metadata-related functions: that's from were the real code of the scripts start. If you want to edit the scripts, that's where you want to do it.

** Important Note N°2
The Quran has 6236 verses. This is the number of verses you should find in any Tanzil/Zekr Tafsir/Translation files. This is also the number of verses you should normally get in any Zekr Quran Audio Recitation file. However, this number could change. This number could vary if each Sûrah has the Basmala as its first verse. For example 002000.mp3 (or 002000.oga) would be the Basmala for Sûratul-Baqarah.

If each Sûrah has its own Basmala the number of files would increase with 114 more verses. This situation as pointed out above, could only arise in the case of the Quran Audio Recitation Files, not of Tanzil/Zekr Translation/Tafsir files. It is very very important, in fact it is compulsory, very vital that all the *OOO.mp3 (or *000.oga) files get deleted before, for example, creating the Playlist files that will be used by the =qap-audio-player= below. If there is an addition of one single file to the 6236 Quran verses, the resulting Playlist file will have an additional 1 line somewhere between the 6236 lines. If this happens, the app will never work properly.

The app heavily relies on the playlist file having 6236 lines, each line corresponding to a verse of the Quran as it appears in any valid Tanzil/Zekr Tafsir/Translation file. As pointed out, the Tanzil/Zekr Translation/Tafsir files could tolerate additional lines, however, they have to appear after the 6236 lines designating the verses of the Quran. This is also the case for the Playlist files. They would tolerate additional lines if they appear after the 6236 lines pointing to the 6236 Quran audio files. The additional lines could give some licence information or any other type of information. These additional lines will never be used by the program.


* tafsir.sh

** SYNOPSIS
   tafsir.sh -a|--ayaat verse(s) -s|--suwar sûrah(s) -f|--tafsir-format format of the tafsir files to generate: txt || htm -h|--help -J|--juz -H|--hizb -R|--rub-ul-hizb -P|--page-number -t|--txt-tafasir -x|--htm-tafasir -o|--output-file-root


** DESCRIPTION
   This script, if given zekr/tanzil translation/tafsir files with the "*trans.zekr" extension, or the  "*trans.zekr.7z" extension will generate/or show the tafsir one or more ayat, one or more suwar passed through the command line as follows:

   -a|--ayaat takes 3-digits designating the Sûrah number followed by 3 other digits for the given verse. For example: 005012  means:
   Sûrah 5, verse 12. Here one can provide verses in this format - one or more, quoted  for instance: '002102 005075 009105'.
One can also provide ayah numbers  in range. For instance:
   '001001_001007'  in such case, the separating character between the two ayaat numbers has to be the underscore character: '_'

   -f|--tafsir-format takes either htm or txt. Quoiting is not needed. This is the format in which the file should be generated.

   -s|--suwar takes  SûrahNumber  (without leading zeros). Here you can input many Sûrah names at the same time. For instance:  '1 9 107 50' ==> this is four Sûrah numbers. The list of Sûrah  has to be quoted also. You can also provide Sûrah numbers in range. For instance:
   '100_105', '1_13' ... In such case, the separating character between the two Sûrah numbers has to also be the underscore character: '_'

   -J|--juz generate tafsir for a given Juz, set of or range of Juz.
   -H|--hizb generate for Hizb, set of Hizb or range of Hizb.
   -R|--rub-ul-hizb generate for Rub-ul-Hizb, set of or range of Rub-ul-Hizb
   -P|--page-number generate for page, set of or range of pages
   -t|--txt-tafasir txt tafasir files folder
   -x|--htm-tafasir html tafasir files folder
   -o|--output-file-root output folder root folder
   -h|--help display this help message.


