Quran-BASH-Scripts-Documentation.org
** EXAMPLES:
   *** ONE AYAH OR ONE SÛRAH:
   E.g.1 (v1): tafsir.sh -f htm -s 15
   E.g.1 (v2): tafsir.sh --tafsir-format txt --suwar 16

   E.g.2 (v1): tafsir.sh -f txt -a 002102
   E.g.2 (v2): tafsir.sh --tafsir-format htm --ayaat 002282

   *** SEPARATE ÂYÂT OR SUWAR:
   E.g.1 (v1): tafsir.sh -f htm -s '1 18 111'
   E.g.1 (v2): tafsir.sh --tafsir-format txt --suwar '16 17 15'

   E.g.2 (v1): tafsir.sh -f txt -a '002102 002023 006100' 
   E.g.2 (v2): tafsir.sh --tafsir-format htm --ayaat '002282 003156 110005'
 
   *** RANGE OF SUWAR OR ÂYÂT:
   E.g.1 (v1): tafsir.sh -f htm -s '90_100'
   E.g.1 (v2): tafsir.sh --tafsir-format txt --suwar '107_114'

   E.g.2 (v1): tafsir.sh -f txt -a '002102_002110' 
   E.g.2 (v2): tafsir.sh --tafsir-format htm --ayaat '002280_003010'

   in E.g.1 we generate a tafsir for the whole Sûrah 15 of the Quran, thus the option -s in E.g.2 we generate a tafsir for verse number 102 of Sûratul-Baqarah, thus the  -a option and the 002102 value entered.

   
** DEPENDENCIES

*** App dependencies
    sed coreutils p7zip-full.

    Under Debian-based GNU/Linux systems run the following to install them:

    =sudo apt install sed coreutils p7zip-full=

    or

    =sudo apt-get install sed coreutils p7zip-full=
    
    On Termux on Android, run:

    =pkg install sed coreutils p7zip-full=

    or

    =apt install sed coreutils p7zip-full=

    or

    =apt-get install sed coreutils p7zip-full=

*** Supported Format of Tafsir Files
    The tafsir files that the program uses are in the format of Tanzil/Zekr translation/tafsir files. You can grab some files from the above-mentioned projects web-sites or (if the tafsir/translation file you would like to work on has not already been setup for zekr/tanzil) create your own. The Tanzil/Zekr file format is a simple text file which has 6236 lines. Each line corresponds to a verse of the Quran. The lines are arranged in the order of the appearance of the verses in the Qur'an from Sûratul-Fatiha to Sûratun-Nâss. Note that after the 6236 lines, you can add some other lines of information or licence, provided that all the 6236 lines of verses appear properly.

*** How to Prepare the Tafsir Files
    Let's say we have a set of Zekr tafsir files (this is recommended, though Tanzil files also work fine) as follows:

#+BEGIN_QUOTE

    en.hilali.trans.zip
    en.jallalayn.trans.zip
    en.sahih.trans.zip
    en.al-quran-info-transliteration.trans.zip

#+END_QUOTE

    To prepare them for this tafsir look-up Bash script, do the following:

#+BEGIN_SRC bash

  # Move them in a working folder
  mkdir ./work
  mv -fv en.hilali.trans.zip en.jallalayn.trans.zip \
     en.sahih.trans.zip \
     en.al-quran-info-transliteration.trans.zip work

  # Change to the working folder
  cd work

  # Extract them
  for file in *.zip
  do
      7z -aoa x "$file"
      # -aoa will make 7z overwrite the file
      # 'translation.properties' which has
      # the same name in all zekr files
  done

  # Rename them to *trans.zekr | *trans.zekr.7z
  for file in *.txt
  do
      mv -fv "$file" "${file%%.txt}.trans.zekr"
  done

  # Compress them with 7z. This is particularly
  # important since these files should never be
  # modified inadvertantly. This is serious stuff!
  for file in *.trans.zekr
  do
      7za a -t7z -m0=lzma -mx=9 -mfb=64 -md=32m -ms=on "${file}.7z" "${file}"
  done

  # Clean-up: OPTIONAL
  # clean-up *.trans.zekr files
  for file in *.trans.zekr
  do
      rm -rfv "${file}"
  done

  # clean-up the original zekr zip files
  for file in *.zip
  do
      rm -rfv "$file"
  done

  # The properties file
  rm -rfv translation.properties

#+END_SRC

   If everything goes fine, we should end up with:
  
   =en.sahih.trans.zekr.7z=
   =en.hilali.trans.zekr.7z=
   =en.jallalayn.trans.zekr.7z=
   =en.al-quran-info-transliteration.trans.zekr.7z=
  
   These are the types of files the script handles! Now, you are ready to copy or move them to the appropriate directories.
  
   For the files containing HTML tags, move them to either:
  
   ="SCRIPT_ROOT_DIR/html-tafasir-files"=
  
   or
  
   ="$HOME/.tafsir/html-tafasir-files"=
  
   or provide your own directory with the CLI swith:
  
   =-x|--htm-tafasir FULL_PATH_TO_TAFSIR_FILES=
  
   For plain text files containing no HTML tags move them to either:
  
   ="SCRIPT_ROOT_DIR/txt-tafasir-files"=
  
   or
  
   ="$HOME/.tafsir/txt-tafasir-files"=
  
   or provide your own directory with the CLI swith:
  
   =-t|--txt-tafasir FULL_PATH_TO_TAFSIR_FILES=
   



* qap-audio-player.sh
  Please, if you have not already read the *Important Note N°2*, go up and do so. This is vital.

** SYNOPSIS
	 qap-audio-player.sh -a|--ayaat verse(s) -s|--suwar sûrah(s) -m|--mpv-speed PlaybackSpeed -l|--mpv-loop LoopNumber -f|--file-loop LoopNumber -g|--groupLoop LoopNumber -p|--play-trans TranslationID --r|--reset-eta (takes no option) -J|--juz JuzNumber -H|--hizb HizbNumber -R|--rub-ul-hizb RubUlHizbNumber-P|--page-number PageNumber -o|--output-quran-html-root WhereToCreateQuran.html -q|--hifz-ul-quran ActivateHifzMode -L|--playlist-file-root WhereToSearchForPlaylist -e|--extension-of-audios QuranAudioFilesExtension -G|--generate-playlist QuranFilesRoot --ara-font-size size --lat-font-size size --metadata-font-size size --table-font-size size --system-font-name FontName --user-font-file FullPathToFontFile -h|--help (takes no option). All the following take no option also: -k|--compact-table --eng-audio --fra-audio --no-ara-txt --translit --eng-txt-sahih --eng-txt-hilali-khan --fra-txt-hamid


