Quran-BASH-Scripts-Documentation.md


<a id="orgedc4819"></a>

## EXAMPLES:

**\*** ONE AYAH OR ONE SÛRAH:
E.g.1 (v1): tafsir.sh -f htm -s 15
E.g.1 (v2): tafsir.sh &#x2013;tafsir-format txt &#x2013;suwar 16

E.g.2 (v1): tafsir.sh -f txt -a 002102
E.g.2 (v2): tafsir.sh &#x2013;tafsir-format htm &#x2013;ayaat 002282

**\*** SEPARATE ÂYÂT OR SUWAR:
E.g.1 (v1): tafsir.sh -f htm -s '1 18 111'
E.g.1 (v2): tafsir.sh &#x2013;tafsir-format txt &#x2013;suwar '16 17 15'

E.g.2 (v1): tafsir.sh -f txt -a '002102 002023 006100' 
E.g.2 (v2): tafsir.sh &#x2013;tafsir-format htm &#x2013;ayaat '002282 003156 110005'

**\*** RANGE OF SUWAR OR ÂYÂT:
E.g.1 (v1): tafsir.sh -f htm -s '90\\<sub>100</sub>'
E.g.1 (v2): tafsir.sh &#x2013;tafsir-format txt &#x2013;suwar '107\\<sub>114</sub>'

E.g.2 (v1): tafsir.sh -f txt -a '002102\\<sub>002110</sub>' 
E.g.2 (v2): tafsir.sh &#x2013;tafsir-format htm &#x2013;ayaat '002280\\<sub>003010</sub>'

in E.g.1 we generate a tafsir for the whole Sûrah 15 of the Quran, thus the option -s in E.g.2 we generate a tafsir for verse number 102 of Sûratul-Baqarah, thus the  -a option and the 002102 value entered.


<a id="org0bb140e"></a>

## DEPENDENCIES


<a id="orge3e2623"></a>

### App dependencies

sed coreutils p7zip-full.

Under Debian-based GNU/Linux systems run the following to install them:

`sudo apt install sed coreutils p7zip-full`

or

`sudo apt-get install sed coreutils p7zip-full`

On Termux on Android, run:

`pkg install sed coreutils p7zip-full`

or

`apt install sed coreutils p7zip-full`

or

`apt-get install sed coreutils p7zip-full`


<a id="org47c5b8b"></a>

### Supported Format of Tafsir Files

The tafsir files that the program uses are in the format of Tanzil/Zekr translation/tafsir files. You can grab some files from the above-mentioned projects web-sites or (if the tafsir/translation file you would like to work on has not already been setup for zekr/tanzil) create your own. The Tanzil/Zekr file format is a simple text file which has 6236 lines. Each line corresponds to a verse of the Quran. The lines are arranged in the order of the appearance of the verses in the Qur'an from Sûratul-Fatiha to Sûratun-Nâss. Note that after the 6236 lines, you can add some other lines of information or licence, provided that all the 6236 lines of verses appear properly.


<a id="org7b78fdc"></a>

### How to Prepare the Tafsir Files

Let's say we have a set of Zekr tafsir files (this is recommended, though Tanzil files also work fine) as follows:

\#+BEGIN\\<sub>QUOTE</sub>

en.hilali.trans.zip
en.jallalayn.trans.zip
en.sahih.trans.zip
en.al-quran-info-transliteration.trans.zip

\#+END\\<sub>QUOTE</sub>

To prepare them for this tafsir look-up Bash script, do the following:

\#+BEGIN\\<sub>SRC</sub> bash

mkdir ./work
mv -fv en.hilali.trans.zip en.jallalayn.trans.zip \\
   en.sahih.trans.zip \\
   en.al-quran-info-transliteration.trans.zip work

cd work

for file in \*.zip
do
    7z -aoa x "$file"

done

for file in \*.txt
do
    mv -fv "\(file" "\){file%%.txt}.trans.zekr"
done

for file in \*.trans.zekr
do
    7za a -t7z -m0=lzma -mx=9 -mfb=64 -md=32m -ms=on "\({file}.7z" "\){file}"
done

for file in \*.trans.zekr
do
    rm -rfv "${file}"
done

for file in \*.zip
do
    rm -rfv "$file"
done

rm -rfv translation.properties

\#+END\\<sub>SRC</sub>

If everything goes fine, we should end up with:

`en.sahih.trans.zekr.7z`
`en.hilali.trans.zekr.7z`
`en.jallalayn.trans.zekr.7z`
`en.al-quran-info-transliteration.trans.zekr.7z`

These are the types of files the script handles! Now, you are ready to copy or move them to the appropriate directories.

For the files containing HTML tags, move them to either:

`"SCRIPT\_ROOT\_DIR/html-tafasir-files"`

or

`"$HOME/.tafsir/html-tafasir-files"`

or provide your own directory with the CLI swith:

`-x|--htm-tafasir FULL\_PATH\_TO\_TAFSIR\_FILES`

For plain text files containing no HTML tags move them to either:

`"SCRIPT\_ROOT\_DIR/txt-tafasir-files"`

or

`"$HOME/.tafsir/txt-tafasir-files"`

or provide your own directory with the CLI swith:

`-t|--txt-tafasir FULL\_PATH\_TO\_TAFSIR\_FILES`


<a id="org38ab610"></a>

# qap-audio-player.sh

Please, if you have not already read the **Important Note N°2**, go up and do so. This is vital.
