Quran-BASH-Scripts-Documentation.md


<a id="org6c99b18"></a>

## SYNOPSIS

qap-audio-player.sh -a|&#x2013;ayaat verse(s) -s|&#x2013;suwar sûrah(s) -m|&#x2013;mpv-speed PlaybackSpeed -l|&#x2013;mpv-loop LoopNumber -f|&#x2013;file-loop LoopNumber -g|&#x2013;groupLoop LoopNumber -p|&#x2013;play-trans TranslationID &#x2013;r|&#x2013;reset-eta (takes no option) -J|&#x2013;juz JuzNumber -H|&#x2013;hizb HizbNumber -R|&#x2013;rub-ul-hizb RubUlHizbNumber-P|&#x2013;page-number PageNumber -o|&#x2013;output-quran-html-root WhereToCreateQuran.html -q|&#x2013;hifz-ul-quran ActivateHifzMode -L|&#x2013;playlist-file-root WhereToSearchForPlaylist -e|&#x2013;extension-of-audios QuranAudioFilesExtension -G|&#x2013;generate-playlist QuranFilesRoot &#x2013;ara-font-size size &#x2013;lat-font-size size &#x2013;metadata-font-size size &#x2013;table-font-size size &#x2013;system-font-name FontName &#x2013;user-font-file FullPathToFontFile -h|&#x2013;help (takes no option). All the following take no option also: -k|&#x2013;compact-table &#x2013;eng-audio &#x2013;fra-audio &#x2013;no-ara-txt &#x2013;translit &#x2013;eng-txt-sahih &#x2013;eng-txt-hilali-khan &#x2013;fra-txt-hamid


<a id="org2718817"></a>

## DESCRIPTION

This script, if given playlist files in zekr/tanzil format with the "\*plst.6236.lines.7z" extension, or "\*plst.6236.lines" extension will read the audio files of ayât, set of ayât, range of ayât; suwar, set of suwar, range of suwar; juz, set of juz, range of juz; ḥizb, set of ḥizb, range of ḥizb; rub-\`ul-ḥizb, set of rub-\`ul-ḥizb, range of rub-\`ul-ḥizb; page, set of pages or range of pages passed to it through the command line in the the following format:

FOR AYÂT: 3-digits designating the Sûrah number followed by 3 other digits for the given verse. For example: 005012.
Henceforth this is what we will name ayah\\<sub>id</sub>. The example above means: Sûrah 5, verse 12.

FOR SUWAR: a simple number ranging from 1 to 114 without
any leading zeros. For example '1' for Sûrah al-Fâtiḥa.

FOR JUZ: a simple number also. Ranging from 1 to 30.

FOR ḤIZB: a number ranging from 1 to 60.

FOR RUB-\`UL-ḤIZB: a number ranging from 1 to 240.

FOR PAGES: a number ranging from 1 to 604.

-s|&#x2013;suwar is followed by SûrahNumber (without leading 0s). Here you can input many Sûrah numbers at the same time.
For instance: '1 9 107 50' - Here we have entered four Sûrah numbers. The list of Sûrah has to be quoted either in single quotes (which is preferred) or double quotes.

You can also provide Sûrah numbers in range. For instance:
'100\\<sub>105</sub>' in such case, the separating char between the two Sûrah numbers has to be the underscore character: '\\\_' 

-a|&#x2013;ayaat has to be followed by Sûrah+Ayah e.g.: 007018 - one or more, quoted. I.e., '002102 005075 009105'

Here also you can provide ayah numbers in range. For instance: '001001\\<sub>001007</sub>' in such case, the separating character between the two ayaat numbers has to be the underscore character also: '\\\_'

-J|&#x2013;juz read Quran audio of a given Juz, set of or range of Juz.
-H|&#x2013;hizb read a Hizb, set of Hizb or range of Hizb.
-R|&#x2013;rub-ul-hizb read a Rub-ul-Hizb, set of or range of Rub-ul-Hizb
-P|&#x2013;page-number read a page, set of or range of pages

Note also that -J, -H, -R, and -P will also take single, many or range of units to be played. A unit may refer to a Juz, a Ḥizb, a Rub-\`ul-Ḥizb or a page. It might also refer to a Sûrah. If you would like to provide any unit in range just separate the two numbers with an underscore character just like above.

Also, do not input any leading zeros. And take into account the maximum  number any unit would accept. For instance there are a total of 30  Juz in the Quran, so you cannot request a playback for Juz number 31 which does not exist.


<a id="orgea3a5b4"></a>

## EXAMPLES

**\*** E.g.1 (v1):
qap-audio-player.sh -s 15 -m 1.8 -l 6 -f 2 -g 3 -p eng -r

**\*** E.g.1 (v2):
qap-audio-player.sh &#x2013;suwar 15 &#x2013;mpv-speed 1.8 &#x2013;mpv-loop 6 &#x2013;file-loop 2 &#x2013;group-loop 3 &#x2013;play-trans eng &#x2013;reset-eta

**\*** E.g.2 (v1):
qap-audio-player.sh -a 001005 -m 1.8 -l 6 -f 2 -g 3 -p eng -r

**\*** E.g.2 (v2):
qap-audio-player.sh &#x2013;ayaat 001005 &#x2013;mpv-speed 1.8 &#x2013;mpv-loop 6 &#x2013;file-loop 2 &#x2013;group-loop 3 &#x2013;play-trans eng &#x2013;reset-eta

In the first example we play the audio for the whole Sûrah 15 of the Quran, thus the option -s|&#x2013;suwar

in the second example we play the audio file for verse number 102 of Sûratul-Baqarah, thus the -a|&#x2013;ayaat option and the 002102 value entered.


<a id="org4e6a34b"></a>

## AS FOR THE REST OF THE OPTIONS:

-m|&#x2013;mpv-speed is the playback speed for the MPV-Player. The default value it 1.00.

-l|&#x2013;mpv-loop is the number of times MPV plays the audio file internally.

-f|&#x2013;file-loop is the file loop number. This is the number of times this programs feeds the file to MPV for it to play it.

If for instance we hand the file twice to MPV and its own loop number is set to 6, then we will end up with 6x2=12. This is the total number of times the file gets played. This is so, if the group-loop option is set to 1. It if is set to 2 for instance then the total number of times the file gets played is:
((6x2) x 2)=24.

-g|&#x2013;group-loop is the group loop number. This loop number refeeds the whole group of files to MPV, and lets it play them all and then rehands them to it.

-p|&#x2013;play-trans will activate translation audio files playback. It takes an argument also which is the translation id.

&#x2013;r|&#x2013;reset-eta will reset the saved playback duration of the previous session.

-o|&#x2013;output-quran-html-root where to generate the quran.html file
-q|&#x2013;hifz-ul-quran activate the 'quran rq\\<sub>ayat</sub>\\<sub>3x</sub>\\<sub>each</sub>\\<sub>then</sub>\\<sub>1</sub>' memorisation mode
-L|&#x2013;playlist-file-root where to look for playlist files. This will override the default values.

-e|&#x2013;extension-of-audios extension of the audio files that are in the directory for which you would like to have the playlist file generated. For this to work -e has to come before -G
-G|&#x2013;generate-playlist quran files folder for which to generate the playlist file

&#x2013;ara-font-size provide a size for use with the arabic verses/tafsirs
&#x2013;lat-font-size font size for the latin text (translations, tafsirs)
&#x2013;metadata-font-size a size to be used when displaying metadata information (elapsed time, number of verses of Sûrah&#x2026;)
&#x2013;table-font-size a size to be used with the table that displays some additional Sûwar, âyât metadata
&#x2013;system-font-name here the user has the possibility to provide the name of a font that is already installed on the system. This is not the full path, it is only the official name of the font as registered on the system.
&#x2013;user-font-file here, one ca provide the full path to a font file whether it is installed on the system or not.

-k|&#x2013;compact-table this toggles the display of the compact set of tables (Sûrah and Âyah metadata tables) specifically designed for Android devices and any other small screen device which is able to run GNU/Linux whether natively, through chroot and whatnot!

&#x2013;eng-audio play english verse interpretation audio
&#x2013;fra-audio play french verse interpretation audio

&#x2013;no-ara-txt do not Quran arabic text of current ayah to output html file

&#x2013;translit show transliteration text of current ayah to the command line and also write it to output html file

&#x2013;eng-txt-sahih show Sahih Int. verse interpretation text of current ayah on the command line and also write it to output html file

&#x2013;eng-txt-hilali-khan show Taqi-ud-Deen al-Hilali & Mushin Khan english verse interpretation on the command line and write it also to output html file

&#x2013;fra-txt-hamid show Muhammad Hamidullah french verse interpretation on the command line and write it also to output html file

-h|&#x2013;help will display this help message.

Most of the above options have default values.
