Quran-BASH-Scripts-Documentation.org
** DEPENDENCIES

    Under Debian-based GNU/Linux systems run the following to install them:

    =sudo apt install sed gawk coreutils perl parallel mpv p7zip-full=

    or

    =sudo apt-get install sed gawk coreutils perl parallel mpv p7zip-full=
    
    On Termux on Android, run:

    =pkg install sed gawk coreutils termux-apis perl parallel mpv p7zip-full=

    or

    =apt install sed gawk coreutils termux-apis perl parallel mpv p7zip-full=

    or

    =apt-get install sed gawk coreutils termux-apis perl parallel mpv p7zip-full=

    Note that the =termux-apis= package is specific to Android and is not available for GNU/Linux. This package is used to display some information on the Android notification bar.


** CREATING THE PLAYLIST FILES
   To generate the playlist files, you need 6236 Quran audio files in a directory. It if recommended that you seperate the 6236 verses into the units that you like. We call unit any of the following: Sûrah, Juz, Ḥizb, Rub-`ul-Ḥizb and Page-Number.
   
   You could use one of the Bash scripts below to divide your 6236 files into the unit you like.
   Please bear in mind that is it very vital that you do not have more that 6236 files before generating the Playlist file. If you get 1 more file then everything will be messed-up completely. If you have additional files designating the Basmalas for each or some Sûrah, then you will have to delete them. To do so, see the code below.

   Change to the directory where your audio verses are located. If they are already divided into Suwar, i.e., each Sûrah has its own folder containing its verses, then just deleted the Basmalas. Otherwise it is recommended to divide the verses into units.

   We recognize the Basmala files by the fact that they bear the number of the suwar+000. e.g.: 003000.mp3 or 110000.mp3. To remove them we simple search for and remove all the files ending in 000.mp3 in case we are dealing with mp3 files. You replace the 'mp3' with the extension of the audio files you are using.

#+BEGIN_SRC bash

  find . -name '*000.mp3' | parallel --line-buffer --jobs=32 'rm -rfv {}'
  # I love GNU-Parallel. If you don't have it installed, use this:

  find . -name '*000.mp3' -exec bash -c 'rm -rfv "$0"' {} \;
  # This should work if you are on any decent GNU/Linux distro

  # If you are dealing with *.oga files,
  # replace the '*000.mp3' with '*000.oga'

#+END_SRC

   If everthing is fine, call the script as follows:

   =qap-audio-player.sh -G QuranFilesRoot AudioFilesExtension=

   or

   =qap-audio-player.sh --generate-playlist QuranFilesRoot AudioFilesExtension=

   For _example:_

   =qap-audio-player.sh -G /home/abu-dju/Verse-By-Verse-Quran-Audio-File/Hudhaify-20k-Hafs oga=

   The Playlist file will be generated in the following directory:
   
   $SCRIPT-ROOT-DIR/Playlist/ -- This is the root directory from where the script is being called by the user. By default this is where the script looks for Playlist files each time it starts up. If the Playlist sub-directory does not exist it will look for Playlist files in $HOME/.qap/Playlists

   The extension of the Playlist files is: =plst.6236.lines.7z= -- It needs to be compressed so that it be well-preserved.
   

* rq-ayat-3x-each-then-1.sh

** SYNOPSYS
   `basename $0` -m|--mpv-speed playback-speed -l--mpv-loop mpv-loop-number -f|--file-loop each-file-loop-number -e|--extension-of-audios QuranAudioFilesExtension -G|--generate-playlist QuranFilesRoot -C|--create-fake-audios NumberOfFakeAudiosPerFolder --ara-font-size size --lat-font-size size --metadata-font-size size --table-font-size size --system-font-name FontName --user-font-file FullPathToFontFile. All the following take no option also: -k|--compact-table --eng-audio --fra-audio --no-ara-txt --translit --eng-txt-sahih --eng-txt-hilali-khan --fra-txt-hamid -h|--help


** DESCRIPTION
        This script tries to implement an algorithm to let the Quranic reader who wishes to memorize a set of verses to do it in a consistent manner. The program gets a list of ayat and then does the following:

	Consider we have a set of five files to play:
	1-reads the first ayah 3 times (the user can change this number);
	2-goes back and reads it 1 time;
	3-moves to the second ayah and reads it 3 times;
	4-goes back and reads the first and second ayaat 1 time each;
	5-moves to the third ayah to play it 3 times;
	6-goes back to the first, second and third ayaat and reads them 1 time each;
	7-moves to the fourth ayah and plays it 3 times;
	8-goes back to the first, second, third and fourth ayaat and plays them 1 time each;
	9-moves to the fifth which is our last ayah and plays it 3 times.

	From the 9th step, since there are no remaining ayaat to be played:
	10-it plays the whole group once;
	11-removes the 1st ayah from the list, and thus plays all but the 1st ayah;
	12-removes the 1st and 2nd ayaat from the list and plays all but the 1st and 2nd ayaat;
	13-removes the 1st 2nd and 3rd ayaat from the list and plays all but the 1st 2nd and 3rd ayaat;
	14-removes the 1st 2nd 3rd and 4th ayaat from the list and plays all but the 1st 2nd 3rd and 4th ayaat
	=> This means, since we only have 5 files to be played, that here we play the 5th and last verse and then exit.

	In total, we would play each verse 3x + 5x (which is the number of total files to play) thus adding up to 8 times.


