Quran-BASH-Scripts-Documentation.org
** COMMAND LINE OPTIONS
         -m|--mpv-speed MPV-Player playback speed (default: 1.00)
	 -l--mpv-loop number of time MPV will play each file, internally
	 -f|--file-loop number of times each file gets handed to MPV so that it plays it while also performing its internal loop. The number of times the file gets played is mpv-loop*file-loop. For example 2*6=12

	 -e|--extension-of-audios extension of the audio files that are in the directory for which you would like to have the playlist file generated. For this to work -e has to come before -G
	 -G|--generate-playlist quran files folder for which to generate the playlist file
 
	 -C|--create-fake-audios generate the fake audio files directory for all the 6236 Quran verses. Takes as argument, the number of files per directory
	 
	 -R|--generate-rortrl-files with this option, you request the creation of the following files:
	 *RECITE_ONCE_LIST
	 *RECITE_THRICE_LIST
	 *RECITE_LAST_LIST
	 You need to create these files in case an error happened that prevents the audios to be played in the correct order. i.e., the program skips some verses - or any other reason that makes you want to do this.
	 This parameter takes as the sole option, either the number '1', or any other number. '1' makes the program generate the first stage files: RECITE_ONCE_LIST and RECITE_THRICE_LIST files. Any other number, other than '1', will make the program generate RECITE_LAST_LIST file.
h
	 --ara-font-size provide a size for use with the arabic verses/tafsirs
	 --lat-font-size font size for the latin text (translations, tafsirs)
	 --metadata-font-size a size to be used when displaying metadata information (elapsed time, number of verses of Sûrah...)
	 --table-font-size a size to be used with the table that displays some additional Sûwar, âyât metadata
	 --system-font-name here the user has the possibility to provide the name of a font that is already installed on the system. This is not the full path, it is only the official name of the font as registered on the system.
	 --user-font-file here, one ca provide the full path to a font file whether it is installed on the system or not.

	 -k|--compact-table this toggles the display of the compact set of tables (Sûrah and Âyah metadata tables) specifically designed for Android devices and any other small screen device which is able to run GNU/Linux whether natively, through chroot and whatnot!
	 
         --eng-audio play english verse interpretation audio
	 --fra-audio play french verse interpretation audio
	 
	 --no-ara-txt do not write Quran arabic text of current ayah to output html file

	 --translit show transliteration text of current ayah to the command line and also write it to output html file

	 --eng-txt-sahih show Sahih Int. verse interpretation text of current ayah on the command line and also write it to output html file

	 --eng-txt-hilali-khan show Taqi-ud-Deen al-Hilali & Mushin Khan english verse interpretation on the command line and write it also to output html file

	 --fra-txt-hamid show Muhammad Hamidullah french verse interpretation on the command line and write it also to output html file
 

** EXAMPLES
        rq-ayat-3x-each-then-1.sh -m|--mpv-speed 1.8 -l|--mpv-loop 6 -f|--file-loop 2

	Playback speed 180%. Make mpv play each file 6 time. Pass each file 2 times to mpv so that it plays it 6 times as indicated above thus playing it 12 times for all."


** DEPENDENCIES
        See the "DEPENDENCIES" section of the qap-audio-player.sh script above.


* Divide Quran 6236 Audio Files to Various Units
  Scripts that divide a set of Zekr Quran audio files into 114 Suwar, 30-Juz, 60-Ḥizb, 240-Rub-ul-Ḥizb or 604-Pages

** divide-quran-per-suwar.sh
   This divides the 6236 Quran audio files into 114 folders, each corresponding to a Sûrah of the Quran.

** divide-quran-per-juz.sh
   This divides the 6236 Quran files into 30 folders, each corresponding to a Juz of the Noble Quran.

** divide-quran-per-hizb-1-safe.sh
   This divides the 6236 Quran audio files into 60 folders, each corresponding to a Ḥizb of the Quran. It has the tag =safe= because it is fast and uses only Bash specific features. This holds true for all the remaining scripts of the list that have that tag.

** divide-quran-per-hizb-2-unsafe.sh
   The =safe= version of the above script.

   *_Question:_* Why have the =unsafe= versions since we have the =safe= ones ?

   *_Answer:_* The =unsafe= version was created first. Then it was used to divide the Quran files on a test-folder. With the result of the run of that script, we were able to use some hacks through the CLI to list the folders and their contents. With these data we created the =safe= version. Since the =safe= version exists thanks to the =unsafe= version, we thought it would not be wise to delete the =unsafe= version.

   The =unsafe= version uses Bash to extrapolate the elements between a range. For instance this excerpt =mv -f {002253..003014} 05= tries to move the elements of the Ḥizb N°5 to a folder named =05=. If you look at the range you will realize that Bash will try to move in fact all the files from 002253 to 003014. We know that Sûratul-Baqarah has a total of 282 verses. Bash will try to move, namely, files 002287, 002288, 002289, 002290, and all the way through 0022999 which do not exit. In fact, here only, it will try to move 713 files that do not exist. This is why this version of the script is tagged =unsafe=. This explanation, holds true for all the remaining scripts tagged =unsafe=.

** divide-quran-per-hizb-roub-1-safe.sh
   Divides the Quran verses into 240 Rub-`ul-Ḥizb. The =safe= version.

** divide-quran-per-hizb-roub-2-unsafe.sh
   The =unsafe= version of the above script.

** divide-quran-per-page-1-safe.sh
   Will divide the Quran version into 604 folders, each corresponding to a page of the Quran in the `Uthmanic Musḥaff.

** divide-quran-per-page-2-unsafe.sh
   The =unsafe= version of the above script.

** Bonus: move-21-ayat-in-subdirs.sh


* div-trans-textFile-to-6236-TXT-Files
  This script, if given a zekr/tanzil translation file with the "*.trans.zekr" extension, will create a folder with the basename of the current input file and then moves to it in order to generate 6236 text files, according to the 6236 lines of the file. Those lines correspond to the 6236 verses of the Quran.

  Next, it will rename them from 0001--6236 to a SûrahNumber+AyahNumber naming scheme that we have derived from the =VerseByVerse= Quran project recitation audio files.

  For instance: 001005 is the 5th verse of surah al-Fatiḥah

  058010 is the 10th verse of the 58th surah of the Quran. And so on. This is what we call the =ayah_id=.

  Please make sure your translation files are correctly named. This program only recognizes files that have the extension: =*.trans.zekr=

  For instance: =en-hilali.trans.zekr= or =en-sahih.trans.zekr= -- Note that the file is not zipped.

** Dependencies:
   we need the following two files:

*** 01-Quran-Verses-Line-Numbers.txt
    This is a simple list of line numbers from 0001 to 6236. This will be used in conjunction with =02-VerseByVerse-Quran-Ayat-List.txt= to rename the generated verses from their original line numbers to their ayah_id.

*** 02-VerseByVerse-Quran-Ayat-List.txt
    This is also a simple list, but it consists of ayah_ids, from 001001 (the first verse of Sûratu-Fatiḥa) to 114006 (the last verse of Sûratun-Nâss).

