Quran-BASH-Scripts-Documentation.org
*** Zekr/Tanzil Translation files
    This may be any Tanzil/Zekr Translation/Tafsir file either downloaded from their respective web-sites or prepared by a third party, provided that the file is well-prepared and is valid. If you would not want to end up with HTML tags in the generated 6236 text files, you would have to remove all HTML tags using some text editor or some regex engine. Google is your best friend here ;-).


* Show Sûrah or Âyah Metadata
  These display various metadata related to either verses or Sûwar of the Quran.

** List of Verses of Surah-Juz-Hizb-RubUlHizb-PageNumber
   These will give the *list* of verses of various units.

*** show-list-of-verses-that-belong-to-this-surah.sh
    Shows the *list* of verses that belong to a particular Sûrah.

*** show-list-of-verses-that-belong-to-this-juz.sh
    Shows the *list* of verses that belong to a particular Juz.

*** show-list-of-verses-that-belong-to-this-hizb.sh
    Shows the *list* of verses that belong to a particular Ḥizb.

*** show-list-of-verses-that-belong-to-this-rub-al-hizb.sh
    Shows the *list* of verses that belong to a particular Rub-`ul-Ḥizb.

*** show-list-of-verses-that-belong-to-this-page-number.sh
    Shows the *list* of verses that belong to a particular page.

** Number of Verses of Surah-Juz-Hizb-RubUlHizb-PageNumber
   These will give, not the *list* of verses, but the *number* of verses of various units.

*** give-the-number-of-verses-of-surah.sh
    Shows the *number* of verses that belong to a particular Sûrah.

*** show-number-of-verses-that-belong-to-this-juz.sh
    Shows the *number* of verses that belong to a particular Juz.

*** show-number-of-verses-that-belong-to-this-hizb.sh
    Shows the *number* of verses that belong to a particular Ḥizb.

*** show-number-of-verses-that-belong-to-this-rub-al-hizb.sh
    Shows the *number* of verses that belong to a particular Rub-`ul-Ḥizb.

*** show-number-of-verses-that-belong-to-this-page-number.sh
    Shows the *number* of verses that belong to a particular page.

** Show ID of the Greater Unit to Which a Verse Belongs
   This will show the *number* (name) of the upper unit to which a verse belongs.

*** show-juz-to-which-this-ayah-belongs.sh
    It takes one ayah and returns the *number* of the Juz to which it belongs. For instance if given the value =002159=, it returns: =02=, which means: the ayah belongs to Juz N°02 of the Quran.

*** show-hizb-to-which-this-ayah-belongs.sh
    It takes one ayah and returns the *number* of the Ḥizb to which it belongs. For instance if given the value =001007=, it returns: =01=, which means: the ayah belongs to Ḥizb N°01 of the Quran.
    
*** show-rub-al-hizb-to-which-this-ayah-belongs.sh
    It takes one ayah and returns the *number* of the Rub-`ul-Ḥizb to which it belongs. For instance if given the value =114006=, returns: =240=, which means: the ayah belongs to Rub-`ul-Ḥizb N°240 of the Quran.

*** show-page-number-to-which-this-ayah-belongs.sh
    It takes one ayah and returns the *number* of the Page to which it belongs. For instance if given the value =002285=, returns: =049=, which means: the ayah belongs to Page N°049 of the Quran.

** Show Some More Info for a Surah
   The following functions take one ayah_id and return some information about the Sûrah to which it belongs.

*** show-surah-meccan-or-medinan.sh
    Shows whether the Sûrah to which this ayah belongs is Meccan or Medinan.

*** show-surah-name-arabic.sh
    Shows the Arabic Name of the Sûrah to which this ayah belongs.

*** show-surah-name-english.sh
    Shows the English Name of the Sûrah to which this ayah belongs.

*** show-surah-number.sh
    Shows the 3-digit Number of the Sûrah to which this ayah belongs.

*** show-surah-number-without-leading-zeros.sh
    Shows the 3-digit Number of the Sûrah to which this ayah belongs, without leading zeros. This means, for instance, that where the above script would return =006=, this one returns =6=. This is sometimes useful for some particular purposes.
    
** Show Number of Elements Contained in the Unit to Which a Verse Belongs
   This take a single ayah_id and returns the number of elements contained the greater unit to which it belongs.

*** get-number-of-ayaat-of-the-surah-to-which-this-ayah-belongs.sh
    Returns the number of verses of the Sûrah to which a given ayah belongs.

** Other Ayah Related BASH Functions


*** ayah-necessitates-sadjdah-or-not.sh


*** play-basmala-for-the-113-suwar.sh


#+TITLE: Quran BASH Scripts
#+AUTHOR: Abu-Djuwairiyyah Karim ibn Muḥammad An-Nidjeri As-Salafî


* Download Section
  If you clone this =github= repository, you will get all the files at once!

** tafsir.sh
   Download Link:
[[file:programs/tafsir.sh.gz][tafsir.sh.gz]]

[[file:programs/uncompressed/tafsir.sh][tafsir.sh]]

** qap-audio-player.sh
   Download Links:
[[file:programs/qap-audio-player.sh.gz][qap-audio-player.sh.gz]]

[[file:programs/uncompressed/qap-audio-player.sh][qap-audio-player.sh]]

** rq-ayat-3x-each-then-1-5.0-ALPHA.sh
   Download Link:
[[file:programs/rq-ayat-3x-each-then-1-5.0-ALPHA.sh.gz][rq-ayat-3x-each-then-1-5.0-ALPHA.sh.gz]]

[[file:programs/uncompressed/rq-ayat-3x-each-then-1-5.0-ALPHA.sh][rq-ayat-3x-each-then-1-5.0-ALPHA.sh]]

** Tafsir Files
    Download Links:
[[file:downloads/html-tafasir-files.7z][HTML Tafsir Files]]
Contains the following files in HTML format:
- 00 - Arabic Text.trans.zekr.7z
- 01 - English - Taqi-ud-Deen al-Hilali and Muhsin Khan.trans.zekr.7z
- 02 - English - Tanweer al-Miqbas.trans.zekr.7z
- 03 - English Jallalayn.trans.zekr.7z
- 04 - English - Tafhimul-Quran - Maududi.trans.zekr.7z
- 05 - English Tafsir ibn Kathir.trans.zekr.7z


[[file:downloads/txt-tafasir-files.7z][TXT Tafsir Files]]
Contains the following files in plain text format:
+ 00 - Arabic Text.trans.zekr.7z
+ 01 - English - Taqi-ud-Deen al-Hilali and Muhsin Khan.trans.zekr.7z
+ 02 - English - Tanweer al-Miqbas.trans.zekr.7z
+ 03 - English Jallalayn.trans.zekr.7z
+ 04 - English - Tafhimul-Quran - Maududi.trans.zekr.7z
+ 05 - English Tafsir ibn Kathir.trans.zekr.7z
   
** Playlist Files + Audios
   Coming soon in Sha Allah.

** Translation Files Divided into 6236 TXT Files
   Coming soon in Sha Allah.

