Quran-BASH-Scripts-Documentation.org
** Scripts that Divide the Quran 6236 Audio Files into Various Units
   Please download the following archive and extract it with =7zip= and you will get the whole set of scripts that divide your Quran 6236 audio files into folders representing various units of the Quran, i.e., Sûrah, Juz, Hizb etc.
    
   Download Link - 7z archive containing all the scrips: 
   [[file:programs/divide-quran-per-PARTS.7z][divide-quran-per-PARTS.7z]]

   Download Links - Separate scripts - *.sh

   [[file:programs/uncompressed/divide-quran-per-PARTS/divide-quran-per-hizb-1-safe.sh][divide-quran-per-hizb-1-safe.sh]]

   [[file:programs/uncompressed/divide-quran-per-PARTS/divide-quran-per-hizb-2-unsafe.sh][divide-quran-per-hizb-2-unsafe.sh]]

   [[file:programs/uncompressed/divide-quran-per-PARTS/divide-quran-per-hizb-roub-1-safe.sh][divide-quran-per-hizb-roub-1-safe.sh]]

   [[file:programs/uncompressed/divide-quran-per-PARTS/divide-quran-per-hizb-roub-2-unsafe.sh][divide-quran-per-hizb-roub-2-unsafe.sh]]

   [[file:programs/uncompressed/divide-quran-per-PARTS/divide-quran-per-juz.sh][divide-quran-per-juz.sh]]

   [[file:programs/uncompressed/divide-quran-per-PARTS/divide-quran-per-page-1-safe.sh][divide-quran-per-page-1-safe.sh]]

   [[file:programs/uncompressed/divide-quran-per-PARTS/divide-quran-per-page-2-unsafe.sh][divide-quran-per-page-2-unsafe.sh]]

   [[file:programs/uncompressed/divide-quran-per-PARTS/divide-quran-per-suwar.sh][divide-quran-per-suwar.sh]]

** Scripts that Divide Translation Text-Files into 6236 TXT Files

   Download link - one 7z archive containing the script and its dependencies: 
   [[file:programs/Divide-Trans-Text-Files-to-6236-Ayat-TXT-Files.7z][Divide-Trans-Text-Files-to-6236-Ayat-TXT-Files.7z]]

   Download Links - *.sh script and *.txt dependencies: 
   [[file:programs/uncompressed/Divide-Trans-Text-Files-to-6236-Ayat-TXT-Files/div-trans-textFile-to-6236-TXT-Files.sh][div-trans-textFile-to-6236-TXT-Files.sh]]

   Its Dependencies:

   [[file:programs/uncompressed/Divide-Trans-Text-Files-to-6236-Ayat-TXT-Files/01-Quran-Verses-Line-Numbers.txt][01-Quran-Verses-Line-Numbers.txt]]

   [[file:programs/uncompressed/Divide-Trans-Text-Files-to-6236-Ayat-TXT-Files/02-VerseByVerse-Quran-Ayat-List.txt][02-VerseByVerse-Quran-Ayat-List.txt]]


   Download Some tranlation files especially prepared for use with the Quran Text or Translation division script above. Note that the files are in the format of the Tanzil/Zekr projects Quran text and translation/tafsir files. Note also the the Quran text division program can also divide the HTLM/TXT tafsir files that the =tafsir.sh= program uses to generate the tafsir of ayaat or suwar.

   Please note that these have not been divided into 6236 files yet. Divide them with the script provided above. If you would like to download alread divides files, go to =Translation Files Divided into 6236 TXT Files=

[[file:downloads/Translations-Without-HTML-Tags.7z][Translations-Without-HTML-Tags.7z]]

The file contains the following:

1. en.asad.trans.zekr
2. en.hilali.trans.zekr
3. en.jallalayn.trans.zekr
4. en.sahih.trans.zekr
5. en.tafheem.trans.zekr
6. en.tafsir-ibn-kathir.trans.zekr
7. en.tanweer.trans.zekr
8. fr.hamidullah.trans.zekr
9. ha.gumi.trans.zekr
10. transliteration.trans.zekr

