Quran-BASH-Scripts-Documentation.org
** Scripts that Show Various Sûrah or Âyah Metadata
   Below, you can download the whole set of functions that display all sorts of information related to Quranic Chapers (Suwar) and verses (âyât)

   Download Link - 7z archive containing all the scrips: 
   [[file:programs/Show_Surah_Metadata.7z][Show-Surah-Metadata.7z]]

   Download Links - Separate scripts - *.sh

   Scripts that Show List of Verses of Surah/Juz/Ḥizb/Rub-ul-Ḥizb/PageNumber:

   [[file:programs/uncompressed/Show_Surah_Metadata/List_of_Verses_of_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-list-of-verses-that-belong-to-this-hizb.sh][show-list-of-verses-that-belong-to-this-hizb.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/List_of_Verses_of_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-list-of-verses-that-belong-to-this-juz.sh][show-list-of-verses-that-belong-to-this-juz.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/List_of_Verses_of_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-list-of-verses-that-belong-to-this-page-number.sh][show-list-of-verses-that-belong-to-this-page-number.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/List_of_Verses_of_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-list-of-verses-that-belong-to-this-rub-al-hizb.sh][show-list-of-verses-that-belong-to-this-rub-al-hizb.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/List_of_Verses_of_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-list-of-verses-that-belong-to-this-surah.sh][show-list-of-verses-that-belong-to-this-surah.sh]]


   Scripts that Show Number of Verses of Surah/Juz/Ḥizb/Rub-ul-Ḥizb/PageNumber:

   [[file:programs/uncompressed/Show_Surah_Metadata/Number_of_Verses_of_Surah-Juz-Hizb-RubUlHizb-PageNumber/give-the-number-of-verses-of-surah.sh][give-the-number-of-verses-of-surah.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Number_of_Verses_of_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-number-of-verses-that-belong-to-this-hizb.sh][show-number-of-verses-that-belong-to-this-hizb.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Number_of_Verses_of_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-number-of-verses-that-belong-to-this-juz.sh][show-number-of-verses-that-belong-to-this-juz.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Number_of_Verses_of_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-number-of-verses-that-belong-to-this-page-number.sh][show-number-of-verses-that-belong-to-this-page-number.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Number_of_Verses_of_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-number-of-verses-that-belong-to-this-rub-al-hizb.sh][show-number-of-verses-that-belong-to-this-rub-al-hizb.sh]]


   Other Ayah Related Scripts:

   [[file:programs/uncompressed/Show_Surah_Metadata/Other_Ayah_Related_BASH_Functions/ayah-necessitates-sadjdah-or-not.sh][ayah-necessitates-sadjdah-or-not.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Other_Ayah_Related_BASH_Functions/play-basmala-for-the-113-suwar.sh][play-basmala-for-the-113-suwar.sh]]


   Scripts that Show the Id of Surah/Juz/Ḥizb/Rub-ul-Ḥizb/PageNumber to which a Verse Belongs:

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_ID_of_the_Greater_Unit_to_Which_a_Verse_Belongs/show-hizb-to-which-this-ayah-belongs.sh][show-hizb-to-which-this-ayah-belongs.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_ID_of_the_Greater_Unit_to_Which_a_Verse_Belongs/show-juz-to-which-this-ayah-belongs.sh][show-juz-to-which-this-ayah-belongs.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_ID_of_the_Greater_Unit_to_Which_a_Verse_Belongs/show-page-number-to-which-this-ayah-belongs.sh][show-page-number-to-which-this-ayah-belongs.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_ID_of_the_Greater_Unit_to_Which_a_Verse_Belongs/show-rub-al-hizb-to-which-this-ayah-belongs.sh][show-rub-al-hizb-to-which-this-ayah-belongs.sh]]


   Scripts that Show the Number of Verses of the Surah/Juz/Ḥizb/Rub-ul-Ḥizb/PageNumber to a Verse Belongs:

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_Number_of_Elements_Contained_in_the_Unit_to_Which_a_Verse_Belongs/get-number-of-ayaat-of-the-HIZB-to-which-this-ayah-belongs.sh][get-number-of-ayaat-of-the-HIZB-to-which-this-ayah-belongs.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_Number_of_Elements_Contained_in_the_Unit_to_Which_a_Verse_Belongs/get-number-of-ayaat-of-the-JUZ-to-which-this-ayah-belongs.sh][get-number-of-ayaat-of-the-JUZ-to-which-this-ayah-belongs.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_Number_of_Elements_Contained_in_the_Unit_to_Which_a_Verse_Belongs/get-number-of-ayaat-of-the-PAGE-to-which-this-ayah-belongs.sh][get-number-of-ayaat-of-the-PAGE-to-which-this-ayah-belongs.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_Number_of_Elements_Contained_in_the_Unit_to_Which_a_Verse_Belongs/get-number-of-ayaat-of-the-RUB-UL-HIZB-to-which-this-ayah-belongs.sh][get-number-of-ayaat-of-the-RUB-UL-HIZB-to-which-this-ayah-belongs.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_Number_of_Elements_Contained_in_the_Unit_to_Which_a_Verse_Belongs/get-number-of-ayaat-of-the-surah-to-which-this-ayah-belongs.sh][get-number-of-ayaat-of-the-surah-to-which-this-ayah-belongs.sh]]


   Scripts that Show Some Extras Information for a Surah:

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_Some_Info_for_a_Surah/show-surah-meccan-or-medinan.sh][show-surah-meccan-or-medinan.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_Some_Info_for_a_Surah/show-surah-name-arabic.sh][show-surah-name-arabic.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_Some_Info_for_a_Surah/show-surah-name-english.sh][show-surah-name-english.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_Some_Info_for_a_Surah/show-surah-number.sh][show-surah-number.sh]]

   [[file:programs/uncompressed/Show_Surah_Metadata/Show_Some_Info_for_a_Surah/show-surah-number-without-leading-zeros.sh][show-surah-number-without-leading-zeros.sh]]


   A Single Script that Shows all the Informations of a Given Ayah - It is the combination of most of the other scripts:
   [[file:programs/uncompressed/Show_Surah_Metadata/00-show-all-verse-metadata.sh][00-show-all-verse-metadata.sh]]

   A Single Script that Shows all the Verses Belonging to A Surah/Juz/Ḥizb/Rub-ul-Ḥizb or PageNumber:
   [[file:programs/uncompressed/Show_Surah_Metadata/show-list-of-verses-of-various-units.sh][show-list-of-verses-of-various-units.sh]]

** Custom Tanzil/Zekr Translation/Tafsir Files
   These are a set of Tanzil/Zekr translation or Tafsir files that I prepared for my personal use over the years. In the past years I did my best to get in touch with the Tanzil project in order to send them these files for the benefit of other people but they wouldn't answer my emails. In the end I got frustrated and stopped sending them emails. Here I am today, after many years, publishing them on the internet myself. All praise is due to Allah, The Lord of the Worlds.
   
   Coming soon in Sha Allah.

** Other Scripts
   Coming soon in Sha Allah.


