Quran-BASH-Scripts-Documentation.md


<a id="org00a7a23"></a>

## Scripts that Show Various Sûrah or Âyah Metadata

Below, you can download the whole set of functions that display all sorts of information related to Quranic Chapers (Suwar) and verses (âyât)

Download Link - 7z archive containing all the scrips: 
[Show-Surah-Metadata.7z](programs/Show\_Surah\_Metadata.7z)

Download Links - Separate scripts - \*.sh

Scripts that Show List of Verses of Surah/Juz/Ḥizb/Rub-ul-Ḥizb/PageNumber:

[show-list-of-verses-that-belong-to-this-hizb.sh](programs/uncompressed/Show\_Surah\_Metadata/List\_of\_Verses\_of\_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-list-of-verses-that-belong-to-this-hizb.sh)

[show-list-of-verses-that-belong-to-this-juz.sh](programs/uncompressed/Show\_Surah\_Metadata/List\_of\_Verses\_of\_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-list-of-verses-that-belong-to-this-juz.sh)

[show-list-of-verses-that-belong-to-this-page-number.sh](programs/uncompressed/Show\_Surah\_Metadata/List\_of\_Verses\_of\_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-list-of-verses-that-belong-to-this-page-number.sh)

[show-list-of-verses-that-belong-to-this-rub-al-hizb.sh](programs/uncompressed/Show\_Surah\_Metadata/List\_of\_Verses\_of\_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-list-of-verses-that-belong-to-this-rub-al-hizb.sh)

[show-list-of-verses-that-belong-to-this-surah.sh](programs/uncompressed/Show\_Surah\_Metadata/List\_of\_Verses\_of\_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-list-of-verses-that-belong-to-this-surah.sh)

Scripts that Show Number of Verses of Surah/Juz/Ḥizb/Rub-ul-Ḥizb/PageNumber:

[give-the-number-of-verses-of-surah.sh](programs/uncompressed/Show\_Surah\_Metadata/Number\_of\_Verses\_of\_Surah-Juz-Hizb-RubUlHizb-PageNumber/give-the-number-of-verses-of-surah.sh)

[show-number-of-verses-that-belong-to-this-hizb.sh](programs/uncompressed/Show\_Surah\_Metadata/Number\_of\_Verses\_of\_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-number-of-verses-that-belong-to-this-hizb.sh)

[show-number-of-verses-that-belong-to-this-juz.sh](programs/uncompressed/Show\_Surah\_Metadata/Number\_of\_Verses\_of\_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-number-of-verses-that-belong-to-this-juz.sh)

[show-number-of-verses-that-belong-to-this-page-number.sh](programs/uncompressed/Show\_Surah\_Metadata/Number\_of\_Verses\_of\_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-number-of-verses-that-belong-to-this-page-number.sh)

[show-number-of-verses-that-belong-to-this-rub-al-hizb.sh](programs/uncompressed/Show\_Surah\_Metadata/Number\_of\_Verses\_of\_Surah-Juz-Hizb-RubUlHizb-PageNumber/show-number-of-verses-that-belong-to-this-rub-al-hizb.sh)

Other Ayah Related Scripts:

[ayah-necessitates-sadjdah-or-not.sh](programs/uncompressed/Show\_Surah\_Metadata/Other\_Ayah\_Related\_BASH\_Functions/ayah-necessitates-sadjdah-or-not.sh)

[play-basmala-for-the-113-suwar.sh](programs/uncompressed/Show\_Surah\_Metadata/Other\_Ayah\_Related\_BASH\_Functions/play-basmala-for-the-113-suwar.sh)

Scripts that Show the Id of Surah/Juz/Ḥizb/Rub-ul-Ḥizb/PageNumber to which a Verse Belongs:

[show-hizb-to-which-this-ayah-belongs.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_ID\_of\_the\_Greater\_Unit\_to\_Which\_a\_Verse\_Belongs/show-hizb-to-which-this-ayah-belongs.sh)

[show-juz-to-which-this-ayah-belongs.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_ID\_of\_the\_Greater\_Unit\_to\_Which\_a\_Verse\_Belongs/show-juz-to-which-this-ayah-belongs.sh)

[show-page-number-to-which-this-ayah-belongs.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_ID\_of\_the\_Greater\_Unit\_to\_Which\_a\_Verse\_Belongs/show-page-number-to-which-this-ayah-belongs.sh)

[show-rub-al-hizb-to-which-this-ayah-belongs.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_ID\_of\_the\_Greater\_Unit\_to\_Which\_a\_Verse\_Belongs/show-rub-al-hizb-to-which-this-ayah-belongs.sh)

Scripts that Show the Number of Verses of the Surah/Juz/Ḥizb/Rub-ul-Ḥizb/PageNumber to a Verse Belongs:

[get-number-of-ayaat-of-the-HIZB-to-which-this-ayah-belongs.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_Number\_of\_Elements\_Contained\_in\_the\_Unit\_to\_Which\_a\_Verse\_Belongs/get-number-of-ayaat-of-the-HIZB-to-which-this-ayah-belongs.sh)

[get-number-of-ayaat-of-the-JUZ-to-which-this-ayah-belongs.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_Number\_of\_Elements\_Contained\_in\_the\_Unit\_to\_Which\_a\_Verse\_Belongs/get-number-of-ayaat-of-the-JUZ-to-which-this-ayah-belongs.sh)

[get-number-of-ayaat-of-the-PAGE-to-which-this-ayah-belongs.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_Number\_of\_Elements\_Contained\_in\_the\_Unit\_to\_Which\_a\_Verse\_Belongs/get-number-of-ayaat-of-the-PAGE-to-which-this-ayah-belongs.sh)

[get-number-of-ayaat-of-the-RUB-UL-HIZB-to-which-this-ayah-belongs.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_Number\_of\_Elements\_Contained\_in\_the\_Unit\_to\_Which\_a\_Verse\_Belongs/get-number-of-ayaat-of-the-RUB-UL-HIZB-to-which-this-ayah-belongs.sh)

[get-number-of-ayaat-of-the-surah-to-which-this-ayah-belongs.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_Number\_of\_Elements\_Contained\_in\_the\_Unit\_to\_Which\_a\_Verse\_Belongs/get-number-of-ayaat-of-the-surah-to-which-this-ayah-belongs.sh)

Scripts that Show Some Extras Information for a Surah:

[show-surah-meccan-or-medinan.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_Some\_Info\_for\_a\_Surah/show-surah-meccan-or-medinan.sh)

[show-surah-name-arabic.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_Some\_Info\_for\_a\_Surah/show-surah-name-arabic.sh)

[show-surah-name-english.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_Some\_Info\_for\_a\_Surah/show-surah-name-english.sh)

[show-surah-number.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_Some\_Info\_for\_a\_Surah/show-surah-number.sh)

[show-surah-number-without-leading-zeros.sh](programs/uncompressed/Show\_Surah\_Metadata/Show\_Some\_Info\_for\_a\_Surah/show-surah-number-without-leading-zeros.sh)

A Single Script that Shows all the Informations of a Given Ayah - It is the combination of most of the other scripts:
[00-show-all-verse-metadata.sh](programs/uncompressed/Show\_Surah\_Metadata/00-show-all-verse-metadata.sh)

A Single Script that Shows all the Verses Belonging to A Surah/Juz/Ḥizb/Rub-ul-Ḥizb or PageNumber:
[show-list-of-verses-of-various-units.sh](programs/uncompressed/Show\_Surah\_Metadata/show-list-of-verses-of-various-units.sh)


<a id="org364bac4"></a>

## Custom Tanzil/Zekr Translation/Tafsir Files

These are a set of Tanzil/Zekr translation or Tafsir files that I prepared for my personal use over the years. In the past years I did my best to get in touch with the Tanzil project in order to send them these files for the benefit of other people but they wouldn't answer my emails. In the end I got frustrated and stopped sending them emails. Here I am today, after many years, publishing them on the internet myself. All praise is due to Allah, The Lord of the Worlds.

Coming soon in Sha Allah.


<a id="orgea22206"></a>

## Other Scripts

Coming soon in Sha Allah.

